
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриЧтенииСозданииНаСервере();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОсновноеИзделиеПриИзменении(Элемент)
	
	Если Не НоменклатураЯвляетсяТоваром(Объект.ОсновноеИзделие) Тогда
		Объект.НормативныйПроцентСухогоВещества = 0;
	КонецЕсли;
	
	УстановитьВидимостьРеквизитовПоТипуНоменклатурыОсновногоИзделия();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()

	УстановитьВидимостьРеквизитовПоТипуНоменклатурыОсновногоИзделия();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьРеквизитовПоТипуНоменклатурыОсновногоИзделия()
	
	ЭтоТовар = НоменклатураЯвляетсяТоваром(Объект.ОсновноеИзделие);
	
	Элементы.НормативныйПроцентСухогоВещества.Видимость = ЭтоТовар;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НоменклатураЯвляетсяТоваром(Номенклатура)
	
	ТипНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "ТипНоменклатуры");
	Возврат ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар;

КонецФункции

#КонецОбласти