
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриЧтенииСозданииНаСервере();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОсновноеИзделиеПриИзменении(Элемент)
	
	УстановитьВидимостьРеквизитовПоТипуНоменклатурыОсновногоИзделия();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()

	УстановитьВидимостьРеквизитовПоТипуНоменклатурыОсновногоИзделия();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьРеквизитовПоТипуНоменклатурыОсновногоИзделия()
	
	ТипНоменклатурыОсновногоИзделия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ОсновноеИзделие, "ТипНоменклатуры");
	ЭтоТовар = ТипНоменклатурыОсновногоИзделия = Перечисления.ТипыНоменклатуры.Товар;
	
	Элементы.НормативныйПроцентСухогоВещества.Видимость = ЭтоТовар;
	
КонецПроцедуры

#КонецОбласти