
#Область ПрограммныйИнтерфейс

Функция МаршрутыДляОбъектаМетаданных(ПолноеИмяОбъектаМетаданных, СсылкаНаОбъект) Экспорт
	
	МаршрутыДляОбъектаМетаданных = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПолноеИмяОбъектаМетаданных", ПолноеИмяОбъектаМетаданных);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаПравил.Маршрут КАК Маршрут,
	|	ТаблицаПравил.Режим КАК Режим,
	|	ТаблицаПравил.Запрос КАК Запрос
	|ИЗ
	|	РегистрСведений.ПравилаРегистрацииКафка КАК ТаблицаПравил
	|ГДЕ
	|	ТаблицаПравил.ПолноеИмяОбъектаМетаданных = &ПолноеИмяОбъектаМетаданных";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.Режим = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьВсегда Тогда
				МаршрутыДляОбъектаМетаданных.Добавить(Выборка.Маршрут);
			Иначе
				Запрос = Новый Запрос;
				Запрос.Текст = Выборка.Запрос;
				Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
				РезультатЗапроса = Запрос.Выполнить();
				
				Если НЕ РезультатЗапроса.Пустой() Тогда
					МаршрутыДляОбъектаМетаданных.Добавить(Выборка.Маршрут);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат МаршрутыДляОбъектаМетаданных;
	
КонецФункции

Функция лимсМаршрутыДляОбъектаМетаданных(ПолноеИмяОбъектаМетаданных, СсылкаНаОбъект) Экспорт
	
	МаршрутыДляОбъектаМетаданных = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПолноеИмяОбъектаМетаданных", ПолноеИмяОбъектаМетаданных);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаПравил.Маршрут КАК Маршрут,
	|	ТаблицаПравил.Режим КАК Режим,
	|	ТаблицаПравил.Запрос КАК Запрос
	|ИЗ
	|	РегистрСведений.лимсПравилаРегистрацииКафка КАК ТаблицаПравил
	|ГДЕ
	|	ТаблицаПравил.ПолноеИмяОбъектаМетаданных = &ПолноеИмяОбъектаМетаданных";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.Режим = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьВсегда Тогда
				МаршрутыДляОбъектаМетаданных.Добавить(Выборка.Маршрут);
			Иначе
				Запрос = Новый Запрос;
				Запрос.Текст = Выборка.Запрос;
				Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
				РезультатЗапроса = Запрос.Выполнить();
				
				Если НЕ РезультатЗапроса.Пустой() Тогда
					МаршрутыДляОбъектаМетаданных.Добавить(Выборка.Маршрут);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат МаршрутыДляОбъектаМетаданных;
	
КонецФункции

#КонецОбласти

