
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("Номенклатура")
		И ЗначениеЗаполнено(Параметры.Номенклатура) Тогда
		РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.Номенклатура,
			Новый Структура("ВидНоменклатуры", "ВидНоменклатуры"));
		
		ВидНоменклатуры = РеквизитыНоменклатуры.ВидНоменклатуры;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
																				"ВидНоменклатуры",
																				ВидНоменклатуры,
																				ВидСравненияКомпоновкиДанных.Равно,
																				,
																				Истина);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
