
#Область ПрограммныйИнтерфейс

Функция ПолучитьКомпоненту() Экспорт

	Клиент = Неопределено;
	Если Не КомпонентаRMQКлиентСервер.ИнициализироватьКомпоненту(Клиент) Тогда
			
		ПодключитьКомпоненту();
		КомпонентаRMQКлиентСервер.ИнициализироватьКомпоненту(Клиент);
		
	КонецЕсли;
	
	Возврат Клиент;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПодключитьКомпоненту(КомпонентаПодключена = Неопределено)
	
	АдресВоВременномХранилище = КомпонентаRMQВызовСервера.ПолучитьАдресМакетаКомпоновки();
	
	УстановитьВнешнююКомпоненту(АдресВоВременномХранилище);
	КомпонентаПодключена = ПодключитьВнешнююКомпоненту(
			АдресВоВременномХранилище,
			"BITERP",
			ТипВнешнейКомпоненты.Native);
	Сообщить(НСтр("ru = 'Компонента подключена!'"));
	
КонецПроцедуры

#КонецОбласти
